# Вариант 10

# Дана строка. Вывести строку, содержащую те же символы, но расположенные в обратном порядке.

a = input('Введите вашу строку: ')
print(a[::-1])
